app/controllers/bets_controller.rb

SELECT "bets".* FROM "bets"
---
  def index
    render json: Bet.all

SELECT  "bets".* FROM "bets" WHERE "bets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    render json: Bet.find(params[:id])

INSERT INTO "bets" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Do a 2 minute wall sit or collapse trying"], ["created_at", "2019-01-24 14:29:34.750255"], ["updated_at", "2019-01-24 14:29:34.750255"]]
---
  def create
    render json: Bet.create(bet_params)