app/controllers/drawings_controller.rb

  def index
    render json: Drawing.all
---
SELECT "drawings".* FROM "drawings"