app/controllers/games_controller.rb

  def index
    render json: Game.all
---
SELECT "games".* FROM "games"

  def show
    render json: Game.find(params[:id])
---
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]