app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "dffadfasdfasdfsdf"], ["created_at", "2019-01-24 00:20:14.708016"], ["updated_at", "2019-01-24 00:20:14.708016"]]
---
  def create
    render json: User.create(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def update
    User.find(params[:id]).update(user_params)