app/controllers/words_controller.rb

SELECT "words".* FROM "words"
---
  def index
    render json: Word.all

SELECT  "words".* FROM "words" WHERE "words"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    render json: Word.find(params[:id])

INSERT INTO "words" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Mandy"], ["created_at", "2019-01-24 01:38:21.581068"], ["updated_at", "2019-01-24 01:38:21.581068"]]
---
 def create
   render json: Word.create(word_params)