app/models/bet.rb

SELECT "games".* FROM "games" WHERE "games"."bet_id" = $1  [["bet_id", 1]]
---
  def bet_games
    self.games.collect do |game|